<script setup></script>

<template>
  <main>
    <h1>Описание задачи</h1>

    <p>
      Цель: Создать простое веб-приложение для управления списком товаров с
      использованием Vue.js.
    </p>

    <br />

    <p>
      Необходимо разработать мини-приложение, которое позволяет пользователю:
    </p>

    <ul>
      <li>
        <mark>Добавлять товар</mark>: Пользователь должен иметь возможность
        добавлять товар в список, указывая название товара, селлера и способ
        интеграции (reels/stories).
      </li>
      <li>
        <mark>Пагинация</mark>: Добавленные товары должны отображаться на
        странице по 20.
      </li>
      <li>
        <mark>Редактировать товары</mark>: Пользователь должен иметь возможность
        редактировать информацию о товарах.
      </li>
      <li>
        <mark>Удалять товары</mark>: Пользователь должен иметь возможность
        удалять книги из списка.
      </li>
      <li>
        <mark>Фильтровать товары</mark>: Реализовать фильтрацию товав по способу
        интеграции.
      </li>
      <li>
        <mark>Сортировка товаров</mark>: Реализовать возможность сортировки
        товаров по алфавиту в различном порядке.
      </li>
    </ul>

    <h2>Требования:</h2>

    <ol>
      <li>
        <mark>Интерфейс</mark> (Простой и интуитивно понятный пользовательский
        интерфейс.Приветствуется использование CSS-препроцессоров (Sass, Less).
        Дизайн должен быть адаптивным, чтобы корректно отображаться на различных
        устройствах.)
      </li>
      <li>
        <mark>Технологии</mark> (Приложение должно быть разработано с
        использованием Vue.js (версии 3). Приветствуется использование
        TypeScript. Управление состоянием может быть реализовано с
        использованием Composition API. Данные о книгах должны сохраняться в
        localStorage, чтобы после обновления страницы список книг сохранялся.)
      </li>
      <li>
        <mark>Качество кода</mark> (Чистый, понятный и документированный код.
        Использование современных возможностей Vue.js, включая компоненты,
        директивы и фильтры. Логичная организация компонентов Vue с
        использованием модульного подхода.)
      </li>
      <li>
        <mark>Дополнительно</mark> (Приветствуется использование Vue Router для
        создания простой навигации, например, для разделения списка товаров и
        страницы с деталями товара. Оформите проект как репозиторий на GitHub
        или другом Git-сервисе, с осмысленной структурой коммитов и README
        файлом, описывающим проект и инструкции по запуску.)
      </li>
    </ol>

    <h2>Критерии оценки:</h2>

    <ul>
      <li>
        <mark>Функциональность</mark>: Насколько корректно и полно реализован
        весь необходимый функционал.
      </li>
      <li>
        <mark>Качество кода</mark>: Чистота, читаемость и организация кода.
      </li>
      <li>
        <mark>UI/UX</mark>: Удобство и эстетика пользовательского интерфейса.
      </li>
      <li>
        <mark>Использование Vue.js</mark>: Насколько грамотно и эффективно
        использованы возможности фреймворка Vue.js.
      </li>
      <li>
        <mark>Документация и тесты</mark>: Наличие комментариев, README файла с
        описанием проекта.
      </li>
    </ul>
  </main>
</template>

<style scoped lang="scss">
p,
li {
  font-size: $font-size-small;
  transition: $transition-duration-normal $transition-easing-4;
  line-height: $line-height-large;
}

/* 900px */
@include responsiveness(tablet-landscape) {
  p,
  li {
    font-size: $font-size-normal;
    line-height: $line-height-normal;
  }
}

/* 1200px */
@include responsiveness(desktop) {
}
</style>
